{
  "intents" : [
    {
      "tag": "salam",
      "patterns": [
        "Hai, apa kabar?",
        "Selamat pagi!",
        "hallo",
        "hai",
        "halo",
        "hei",
        "hi",
        "hy",
        "pagi",
        "morning",
        "siang",
        "afternoon",
        "sore",
        "malam",
        "bro",
        "sis",
        "kawan",
        "Selamat siang!",
        "Selamat malam!",
        "Apa kabar hari ini?",
        "Halo, apa kabar?"
      ],
      "responses": [
        "Halo! Saya baik, terima kasih. Bagaimana saya bisa membantu Anda hari ini?",
        "Hai! Selamat datang di situs kami. Ada yang bisa saya bantu?",
        "Halo! Jangan ragu bertanya jika ada yang ingin Anda ketahui.",
        "Helo! Cece di sini untuk membantu. Ada pertanyaan atau bantuan yang Anda butuhkan?",
        "Halo! Apa yang bisa saya bantu untuk Anda hari ini?",
        "Hai! Bagaimana hari Anda? Ada yang bisa saya bantu?",
        "Selamat datang! Apa yang bisa saya bantu hari ini?"
      ]
    },
    {
      "tag": "identitas_bot",
      "patterns": [
        "Apakah kamu manusia atau robot?",
        "Kamu ini manusia atau bot?",
        "Kamu ini robot atau manusia?",
        "Kamu ini bot atau manusia ya?"
      ],
      "responses": [
        "Saya adalah bot cerdas yang siap membantu Anda. Bagaimana saya bisa mendukung Anda hari ini?",
        "Saya adalah bot dan saya di sini untuk membantu Anda. Apa yang bisa saya lakukan untuk Anda hari ini?",
        "Saya adalah bot dan saya siap membantu Anda. Ada yang bisa saya bantu?",
        "Saya adalah bot dan saya di sini untuk membantu menjawab pertanyaan Anda. Bagaimana saya bisa membantu Anda hari ini?"
      ]
    },
    {
      "tag": "pertanyaan_produk",
      "patterns": [
        "Halo, saya memiliki pertanyaan tentang produk Anda.",
        "Saya ingin bertanya tentang produk Anda.",
        "Saya punya pertanyaan tentang produk Anda.",
        "Bisa tolong jelaskan tentang produk Anda?"
      ],
      "responses": [
        "Tentu, saya senang membantu! Apa yang ingin Anda ketahui lebih lanjut tentang produk kami?",
        "Tentu saja, saya siap membantu! Apa pertanyaan Anda tentang produk kami?",
        "Ya, tentu saja! Saya di sini untuk membantu. Apa yang ingin Anda tahu tentang produk kami?",
        "Tentu saja! Saya di sini untuk membantu. Apa pertanyaan Anda tentang produk kami?"
      ]
    },
    {
      "tag": "selamat_tinggal",
      "patterns": [
        "Selamat tinggal",
        "Sampai jumpa",
        "Goodbye",
        "Sampai bertemu lagi",
        "Sampai nanti",
        "bye",
        "Sampai jumpa nanti",
        "Sampai bertemu nanti",
        "Selamat tinggal, sampai jumpa lagi"
      ],
      "responses": [
        "Selamat tinggal! Jika Anda membutuhkan bantuan lebih lanjut, jangan ragu untuk kembali.",
        "Sampai jumpa! Jika ada pertanyaan lebih lanjut, silakan hubungi kami.",
        "Goodbye! Semoga harimu menyenangkan. Jangan sungkan untuk datang kembali.",
        "Sampai bertemu lagi! Jika Anda membutuhkan informasi tambahan, kami selalu siap membantu.",
        "Sampai nanti! Terima kasih atas kunjungan Anda. Jangan ragu untuk datang kembali kapan saja.",
        "Selamat tinggal! Jangan ragu untuk kembali jika Anda memiliki pertanyaan lain."
      ]
    },
    {
      "tag": "ucapan_terima_kasih",
      "patterns": [
        "Terima kasih atas bantuanmu!",
        "Terima kasih",
        "Thanks",
        "Makasih",
        "Terimakasih banyak",
        "Thank you",
        "Terima kasih atas bantuannya!",
        "Terima kasih atas informasinya!",
        "Terima kasih banyak atas bantuannya!"
      ],
      "responses": [
        "Sama-sama! Jika ada pertanyaan lain, jangan ragu untuk bertanya.",
        "Sama-sama! Jika ada yang perlu ditanyakan lagi, silakan beri tahu.",
        "Terima kasih atas kunjungan Anda! Jangan ragu untuk kembali jika ada pertanyaan tambahan.",
        "Senang bisa membantu! Jika Anda membutuhkan bantuan di masa depan, jangan sungkan untuk menghubungi kami.",
        "Terimakasih banyak! Semoga harimu menyenangkan.",
        "Thank you! Jangan ragu untuk datang lagi jika ada yang perlu ditanyakan.",
        "Sama-sama! Senang bisa membantu. Jika ada pertanyaan lain, jangan ragu untuk bertanya."
      ]
    },
    {
      "tag": "jam_kerja",
      "patterns": [
        "Kapan jam kerja Anda?",
        "Jam berapa Anda buka?",
        "Jam berapa Anda tutup?",
        "Apakah Anda buka 24 jam?",
        "Apakah Anda buka setiap hari?"
      ],
      "responses": [
        "Kami tersedia 24/7 untuk membantu Anda. Jika Anda memiliki pertanyaan, silakan beri tahu saya.",
        "Kami buka setiap saat untuk melayani Anda.",
        "Kami selalu siap membantu Anda, kapan pun Anda butuhkan.",
        "Layanan kami tersedia 24 jam sehari, 7 hari seminggu."
      ]
    },
    {
      "tag": "informasi_umum",
      "patterns": [
        "Saya baru di sini, apa yang perlu saya ketahui?",
        "Apa yang perlu saya ketahui sebagai pengguna baru?",
        "Apa yang perlu saya lakukan setelah mendaftar?",
        "Apa saja fitur utama situs web Anda?"
      ],
      "responses": [
        "Selamat datang! Kami menyediakan berbagai produk dan layanan. Jika Anda memiliki pertanyaan spesifik, jangan ragu untuk bertanya.",
        "Selamat datang! Kami senang Anda bergabung. Anda dapat mulai dengan menjelajahi berbagai produk dan layanan kami.",
        "Selamat datang di situs kami! Anda dapat mulai dengan melihat katalog produk kami atau membaca FAQ kami untuk informasi lebih lanjut.",
        "Halo dan selamat datang! Kami menawarkan berbagai produk dan layanan. Jika Anda memiliki pertanyaan, jangan ragu untuk menghubungi kami."
      ]
    },
    {
      "tag": "produk_baru",
      "patterns": [
        "Apakah ada produk baru yang telah dirilis?",
        "Apa saja produk baru Anda?",
        "Bisakah Anda memberi tahu saya tentang produk baru Anda?",
        "Apa produk terbaru Anda?"
      ],
      "responses": [
        "Ya, kami selalu memperbarui katalog kami dengan produk baru. Anda dapat melihatnya di bagian 'Produk Baru' di situs web kami.",
        "Kami selalu menambahkan produk baru ke katalog kami. Anda dapat menemukannya di bagian 'Produk Baru' di situs web kami.",
        "Kami selalu memiliki produk baru yang menarik. Silakan cek bagian 'Produk Baru' di situs web kami untuk melihatnya.",
        "Kami terus memperbarui katalog kami dengan produk baru. Anda dapat menemukannya di bagian 'Produk Baru' di situs web kami."
      ]
    },
    {
      "tag": "panduan_pengguna",
      "patterns": [
        "Apakah ada panduan pengguna untuk produk ini?",
        "Di mana saya bisa menemukan panduan pengguna?",
        "Apakah Anda memiliki panduan pengguna yang bisa saya unduh?",
        "Bagaimana cara mendapatkan panduan pengguna?"
      ],
      "responses": [
        "Ya, setiap produk kami dilengkapi dengan panduan pengguna yang dapat Anda unduh di situs web kami.",
        "Setiap produk kami memiliki panduan pengguna yang dapat Anda akses dan unduh di situs web kami.",
        "Panduan pengguna untuk semua produk kami tersedia untuk diunduh di situs web kami.",
        "Anda dapat menemukan dan mengunduh panduan pengguna untuk setiap produk kami di situs web kami."
      ]
    },
    {
      "tag": "produk_terlaris",
      "patterns": [
        "Produk mana yang paling laris saat ini?",
        "Apa produk terlaris Anda?",
        "Produk apa yang paling populer saat ini?",
        "Apa produk terpopuler Anda saat ini?"
      ],
      "responses": [
        "Produk kami yang paling laris saat ini adalah [nama produk]. Anda dapat menemukannya di bagian 'Produk Terlaris' di situs web kami.",
        "Produk kami yang paling populer saat ini adalah [nama produk]. Anda dapat menemukannya di bagian 'Produk Terlaris' di situs web kami.",
        "Produk kami yang paling banyak dibeli saat ini adalah [nama produk]. Anda dapat menemukannya di bagian 'Produk Terlaris' di situs web kami.",
        "Produk kami yang paling banyak dicari saat ini adalah [nama produk]. Anda dapat menemukannya di bagian 'Produk Terlaris' di situs web kami."
      ]
    },
    {
      "tag": "produk_ramah_lingkungan",
      "patterns": [
        "Apakah produk-produk Anda ramah lingkungan?",
        "Apakah Anda menjual produk yang ramah lingkungan?",
        "Apakah produk Anda dibuat dengan bahan yang ramah lingkungan?",
        "Apakah Anda memiliki produk yang ramah lingkungan?"
      ],
      "responses": [
        "Kami berkomitmen untuk menjaga lingkungan. Banyak dari produk kami dibuat dari bahan yang ramah lingkungan.",
        "Ya, kami sangat peduli terhadap lingkungan. Banyak produk kami yang ramah lingkungan.",
        "Kami selalu berusaha untuk menjaga lingkungan. Oleh karena itu, banyak produk kami yang ramah lingkungan.",
        "Kami berkomitmen untuk melindungi lingkungan. Oleh karena itu, kami memastikan bahwa banyak produk kami ramah lingkungan."
      ]
    },
    {
      "tag": "ketersediaan_warna",
      "patterns": [
        "Bagaimana cara saya mengetahui ketersediaan warna untuk produk ini?",
        "Apakah produk Z tersedia dalam beberapa warna?",
        "Apakah produk ini tersedia dalam warna lain?",
        "Apakah saya bisa mendapatkan produk ini dalam warna yang berbeda?"
      ],
      "responses": [
        "Anda dapat melihat ketersediaan warna untuk setiap produk di halaman detail produk di situs web kami.",
        "Informasi tentang ketersediaan warna untuk setiap produk dapat ditemukan di halaman detail produk kami.",
        "Anda dapat mengetahui warna apa saja yang tersedia untuk produk ini di halaman detail produk di situs web kami.",
        "Untuk mengetahui warna apa saja yang tersedia untuk produk ini, Anda bisa melihatnya di halaman detail produk di situs web kami."
      ]
    },
    {
      "tag": "perawatan_produk",
      "patterns": [
        "Bagaimana cara merawat produk ini?",
        "Apa yang harus saya lakukan untuk merawat produk ini?",
        "Bagaimana cara menjaga produk ini agar tetap awet?",
        "Apa yang harus saya lakukan untuk menjaga produk ini?"
      ],
      "responses": [
        "Setiap produk kami dilengkapi dengan instruksi perawatan yang dapat Anda temukan di panduan pengguna atau di situs web kami.",
        "Anda dapat menemukan instruksi perawatan untuk setiap produk di panduan pengguna atau di situs web kami.",
        "Instruksi perawatan untuk setiap produk kami dapat ditemukan di panduan pengguna atau di situs web kami.",
        "Untuk merawat produk ini, Anda dapat mengikuti instruksi yang ada di panduan pengguna atau di situs web kami."
      ]
    },
    {
      "tag": "perbandingan_produk",
      "patterns": [
        "Apa perbedaan antara produk A dan produk B?",
        "Bagaimana cara membandingkan beberapa produk sebelum memutuskan untuk membeli?",
        "Bagaimana cara membandingkan produk A dan B?",
        "Apa perbedaan utama antara produk A dan B?"
      ],
      "responses": [
        "Anda dapat membandingkan produk di situs web kami dengan memilih 'Bandingkan' di halaman produk.",
        "Anda dapat membandingkan produk dengan memilih opsi 'Bandingkan' di halaman produk di situs web kami.",
        "Untuk membandingkan produk, Anda dapat memilih 'Bandingkan' di halaman produk di situs web kami.",
        "Anda dapat membandingkan produk dengan memilih opsi 'Bandingkan' di halaman produk kami."
      ]
    },
    {
      "tag": "garansi_produk",
      "patterns": [
        "Apakah ada garansi untuk produk ini?",
        "Apakah produk ini memiliki garansi?",
        "Apakah produk ini datang dengan garansi?",
        "Apakah saya mendapatkan garansi jika membeli produk ini?"
      ],
      "responses": [
        "Ya, kami menawarkan garansi untuk sebagian besar produk kami. Detail garansi dapat ditemukan di halaman detail produk.",
        "Ya, sebagian besar produk kami dilengkapi dengan garansi. Anda dapat menemukan detailnya di halaman detail produk.",
        "Kami menawarkan garansi untuk sebagian besar produk kami. Anda dapat menemukan informasi lebih lanjut di halaman detail produk.",
        "Sebagian besar produk kami datang dengan garansi. Detail garansi dapat ditemukan di halaman detail produk."
      ]
    },
    {
      "tag": "ulasan_pelanggan",
      "patterns": [
        "Bagaimana cara mendapatkan ulasan pelanggan untuk produk ini?",
        "Di mana saya bisa menemukan ulasan pelanggan tentang produk ini?",
        "Apakah ada ulasan pelanggan untuk produk ini?",
        "Apakah Anda memiliki ulasan pelanggan untuk produk ini?"
      ],
      "responses": [
        "Ulasan pelanggan untuk setiap produk dapat ditemukan di bagian bawah halaman detail produk di situs web kami.",
        "Anda dapat menemukan ulasan pelanggan untuk setiap produk di bagian bawah halaman detail produk di situs web kami.",
        "Ulasan pelanggan untuk produk ini dapat ditemukan di bagian bawah halaman detail produk di situs web kami.",
        "Anda dapat membaca ulasan pelanggan untuk produk ini di bagian bawah halaman detail produk di situs web kami."
      ]
    },
    {
      "tag": "target_pasar",
      "patterns": [
        "Produk ini cocok untuk siapa?",
        "Siapa target pasar untuk produk ini?",
        "Untuk siapa produk ini ditujukan?",
        "Siapa yang seharusnya menggunakan produk ini?"
      ],
      "responses": [
        "Produk ini dirancang untuk berbagai jenis konsumen. Detail target pasar dapat ditemukan di halaman detail produk.",
        "Produk ini dirancang untuk berbagai jenis pengguna. Anda dapat menemukan detail target pasar di halaman detail produk.",
        "Produk ini cocok untuk berbagai jenis konsumen. Anda dapat menemukan informasi lebih lanjut di halaman detail produk.",
        "Produk ini dirancang untuk berbagai jenis pengguna. Informasi lebih lanjut dapat ditemukan di halaman detail produk."
      ]
    },
    {
      "tag": "panduan_ukuran",
      "patterns": [
        "Apakah ada panduan ukuran untuk pakaian Anda?",
        "Di mana saya bisa menemukan panduan ukuran untuk pakaian Anda?",
        "Apakah Anda memiliki panduan ukuran untuk pakaian Anda?",
        "Bagaimana cara saya mengetahui ukuran pakaian Anda?"
      ],
      "responses": [
        "Ya, kami memiliki panduan ukuran untuk semua pakaian kami. Anda dapat menemukannya di halaman detail produk.",
        "Kami menyediakan panduan ukuran untuk semua pakaian kami di halaman detail produk.",
        "Anda dapat menemukan panduan ukuran untuk semua pakaian kami di halaman detail produk.",
        "Panduan ukuran untuk semua pakaian kami tersedia di halaman detail produk."
      ]
    },
    {
      "tag": "demo_produk",
      "patterns": [
        "Apakah ada video demo untuk produk ini?",
        "Di mana saya bisa menemukan video demo untuk produk ini?",
        "Apakah Anda memiliki video demo untuk produk ini?",
        "Bagaimana cara saya menonton video demo untuk produk ini?"
      ],
      "responses": [
        "Ya, kami memiliki video demo untuk banyak produk kami. Anda dapat menemukannya di halaman detail produk.",
        "Kami menyediakan video demo untuk banyak produk kami di halaman detail produk.",
        "Anda dapat menemukan video demo untuk banyak produk kami di halaman detail produk.",
        "Video demo untuk banyak produk kami tersedia di halaman detail produk."
      ]
    },
    {
      "tag": "sertifikasi_keamanan",
      "patterns": [
        "Apakah produk ini memiliki sertifikasi keamanan?",
        "Di mana saya bisa menemukan sertifikasi keamanan untuk produk ini?",
        "Apakah Anda memiliki sertifikasi keamanan untuk produk ini?",
        "Bagaimana cara saya mengetahui jika produk ini memiliki sertifikasi keamanan?"
      ],
      "responses": [
        "Ya, banyak produk kami memiliki sertifikasi keamanan. Detail sertifikasi dapat ditemukan di halaman detail produk.",
        "Kami menyediakan detail sertifikasi keamanan untuk banyak produk kami di halaman detail produk.",
        "Anda dapat menemukan detail sertifikasi keamanan untuk banyak produk kami di halaman detail produk.",
        "Detail sertifikasi keamanan untuk banyak produk kami tersedia di halaman detail produk."
      ]
    },
    {
      "tag": "rekomendasi_produk",
      "patterns": [
        "Apakah ada produk sejenis yang dapat Anda rekomendasikan?",
        "Apa produk sejenis yang Anda rekomendasikan?",
        "Bisakah Anda merekomendasikan produk sejenis?",
        "Apa produk lain yang Anda rekomendasikan?"
      ],
      "responses": [
        "Tentu, berdasarkan preferensi Anda, kami merekomendasikan [nama produk]. Anda dapat menemukannya di situs web kami.",
        "Berdasarkan apa yang Anda cari, kami merekomendasikan [nama produk]. Anda dapat menemukannya di situs web kami.",
        "Kami merekomendasikan [nama produk] berdasarkan preferensi Anda. Anda dapat menemukannya di situs web kami.",
        "Produk [nama produk] mungkin sesuai dengan apa yang Anda cari. Anda dapat menemukannya di situs web kami."
      ]
    },
    {
      "tag": "diskon",
      "patterns": [
        "Apakah ada diskon untuk pembelian dalam jumlah besar?",
        "Apakah Anda menawarkan diskon untuk pembelian dalam jumlah besar?",
        "Bisakah saya mendapatkan diskon jika membeli dalam jumlah besar?",
        "Apakah Anda memiliki penawaran khusus untuk pembelian dalam jumlah besar?"
      ],
      "responses": [
        "Ya, kami menawarkan diskon untuk pembelian dalam jumlah besar. Silakan hubungi tim penjualan kami untuk detail lebih lanjut.",
        "Kami memberikan diskon untuk pembelian dalam jumlah besar. Untuk detail lebih lanjut, silakan hubungi tim penjualan kami.",
        "Anda dapat mendapatkan diskon jika membeli dalam jumlah besar. Silakan hubungi tim penjualan kami untuk informasi lebih lanjut.",
        "Kami memiliki penawaran khusus untuk pembelian dalam jumlah besar. Silakan hubungi tim penjualan kami untuk detail lebih lanjut."
      ]
    },
    {
      "tag": "waktu_pengiriman",
      "patterns": [
        "Berapa lama waktu pengiriman normal untuk produk ini?",
        "Kapan saya bisa mengharapkan produk ini tiba?",
        "Berapa lama biasanya waktu pengiriman untuk produk ini?",
        "Kapan produk ini akan sampai?"
      ],
      "responses": [
        "Waktu pengiriman normal untuk produk ini adalah [jumlah hari] hari kerja. Namun, ini dapat bervariasi tergantung pada lokasi Anda.",
        "Biasanya, produk ini akan sampai dalam [jumlah hari] hari kerja, tetapi ini bisa berbeda tergantung pada lokasi Anda.",
        "Produk ini biasanya akan sampai dalam [jumlah hari] hari kerja, tetapi waktu pengiriman bisa berbeda tergantung pada lokasi Anda.",
        "Anda dapat mengharapkan produk ini tiba dalam [jumlah hari] hari kerja, tetapi ini bisa berbeda tergantung pada lokasi Anda."
      ]
    },
    {
      "tag": "keunggulan_produk",
      "patterns": [
        "Apa yang membuat produk ini unggul dibandingkan dengan produk serupa di pasaran?",
        "Mengapa saya harus memilih produk ini dibandingkan produk lain?",
        "Apa keunggulan produk ini dibandingkan produk lain?",
        "Mengapa produk ini lebih baik dibandingkan produk lain?"
      ],
      "responses": [
        "Produk kami menawarkan [fitur unik] yang membuatnya unggul dibandingkan dengan produk serupa di pasaran.",
        "Keunggulan produk kami adalah [fitur unik], yang membuatnya berbeda dari produk lain di pasaran.",
        "Produk kami memiliki [fitur unik] yang tidak dimiliki oleh produk lain, membuatnya unggul di pasaran.",
        "Apa yang membuat produk kami unggul adalah [fitur unik] yang tidak dimiliki oleh produk lain."
      ]
    },      
    {
      "tag": "cara_pemesanan",
      "patterns": [
        "Bagaimana cara saya memesan produk melalui situs web Anda?",
        "Bagaimana proses pemesanan produk di situs web Anda?",
        "Apa langkah-langkah untuk memesan produk di situs web Anda?",
        "Bagaimana cara saya membeli produk di situs web Anda?"
      ],
      "responses": [
        "Proses pemesanan sangat mudah. Pilih produk yang Anda inginkan, tambahkan ke keranjang, dan ikuti langkah-langkah checkout. Apakah ada yang bisa saya bantu?",
        "Untuk memesan produk, cukup pilih produk yang Anda inginkan, tambahkan ke keranjang, dan ikuti petunjuk checkout. Jika Anda membutuhkan bantuan lebih lanjut, beri tahu saya.",
        "Pemesanan produk di situs web kami sangat mudah. Cukup pilih produk yang Anda suka, tambahkan ke keranjang, dan ikuti langkah-langkah checkout. Jika Anda memiliki pertanyaan lain, jangan ragu untuk bertanya.",
        "Anda dapat memesan produk dengan mudah di situs web kami. Pilih produk yang Anda inginkan, tambahkan ke keranjang, dan ikuti petunjuk checkout. Jika Anda membutuhkan bantuan lebih lanjut, beri tahu saya."
      ]
    },
    {
      "tag": "proses_pembayaran",
      "patterns": [
        "Apa langkah-langkahnya untuk menyelesaikan proses pembayaran?",
        "Bagaimana cara saya menyelesaikan pembayaran?",
        "Apa yang harus saya lakukan untuk menyelesaikan pembayaran?",
        "Bagaimana proses pembayaran di situs web Anda?"
      ],
      "responses": [
        "Setelah Anda memilih produk, ikuti langkah-langkah pembayaran saat checkout. Pilih metode pembayaran, masukkan informasi yang diperlukan, dan konfirmasikan pembelian Anda.",
        "Untuk menyelesaikan pembayaran, pilih produk yang Anda inginkan, lanjutkan ke checkout, pilih metode pembayaran yang Anda inginkan, masukkan detail pembayaran, dan konfirmasikan pembelian Anda.",
        "Setelah Anda memilih produk yang Anda inginkan, lanjutkan ke checkout, pilih metode pembayaran, masukkan detail pembayaran, dan konfirmasikan pembelian Anda.",
        "Proses pembayaran di situs web kami sangat mudah. Setelah Anda memilih produk, lanjutkan ke checkout, pilih metode pembayaran, masukkan detail pembayaran, dan konfirmasikan pembelian Anda."
      ]
    },
    {
      "tag": "batasan_pemesanan",
      "patterns": [
        "Apakah ada batasan jumlah produk yang dapat saya pesan sekaligus?",
        "Apakah ada batas maksimum untuk jumlah produk yang dapat saya pesan?",
        "Berapa banyak produk yang dapat saya pesan sekaligus?",
        "Apakah ada batas untuk berapa banyak produk yang dapat saya beli sekaligus?"
      ],
      "responses": [
        "Tidak ada batasan kuantitas pembelian. Anda dapat memesan sebanyak yang Anda inginkan sesuai dengan ketersediaan stok.",
        "Kami tidak memiliki batasan jumlah produk yang dapat Anda pesan. Anda bebas memesan sebanyak yang Anda inginkan, selama stok tersedia.",
        "Anda dapat memesan sebanyak yang Anda inginkan dari setiap produk, selama stok masih tersedia.",
        "Kami tidak menetapkan batas untuk jumlah produk yang dapat Anda pesan. Anda dapat memesan sebanyak yang Anda inginkan, selama stok tersedia."
      ]
    },
    {
      "tag": "ubah_pesanan",
      "patterns": [
        "Apakah saya bisa mengubah pesanan setelah proses pembayaran?",
        "Bisakah saya mengubah pesanan saya setelah saya membayar?",
        "Apakah mungkin untuk mengubah pesanan setelah pembayaran?",
        "Bisakah saya membuat perubahan pada pesanan saya setelah saya membayar?"
      ],
      "responses": [
        "Sayangnya, setelah proses pembayaran selesai, pesanan tidak dapat diubah. Pastikan untuk memeriksa pesanan dengan cermat sebelum melanjutkan pembayaran.",
        "Setelah Anda menyelesaikan pembayaran, pesanan Anda tidak dapat diubah. Pastikan untuk memeriksa semua detail dengan cermat sebelum Anda membayar.",
        "Setelah proses pembayaran selesai, kami tidak dapat melakukan perubahan pada pesanan Anda. Pastikan untuk memeriksa semua detail pesanan Anda sebelum Anda membayar.",
        "Sayangnya, setelah pembayaran selesai, kami tidak dapat mengubah pesanan Anda. Harap periksa pesanan Anda dengan cermat sebelum Anda membayar."
      ]
    },
    {
      "tag": "pembatalan_pesanan",
      "patterns": [
        "Bagaimana cara membatalkan pesanan?",
        "Apa yang harus saya lakukan untuk membatalkan pesanan?",
        "Bagaimana saya bisa membatalkan pesanan saya?",
        "Apa prosedur untuk membatalkan pesanan?"
      ],
      "responses": [
        "Jika Anda ingin membatalkan pesanan, segera hubungi layanan pelanggan kami melalui email di cancel@contohlayanan.com dengan menyertakan nomor pesanan Anda.",
        "Untuk membatalkan pesanan, silakan kirim email ke cancel@contohlayanan.com dengan nomor pesanan Anda dan kami akan membantu Anda dengan proses pembatalan.",
        "Anda dapat membatalkan pesanan dengan mengirim email ke cancel@contohlayanan.com dan menyertakan nomor pesanan Anda.",
        "Jika Anda perlu membatalkan pesanan, kirim email ke cancel@contohlayanan.com dengan nomor pesanan Anda dan kami akan membantu Anda."
      ]
    },
    {
      "tag": "keterlambatan_pesanan",
      "patterns": [
        "Apa yang harus saya lakukan jika pesanan saya tidak tiba tepat waktu?",
        "Pesanan saya belum tiba, apa yang harus saya lakukan?",
        "Pesanan saya terlambat, apa yang harus saya lakukan?",
        "Apa yang harus saya lakukan jika pesanan saya terlambat?"
      ],
      "responses": [
        "Jika pesanan Anda terlambat, beri tahu kami melalui formulir kontak di situs web atau hubungi layanan pelanggan di support@contohlayanan.com, dan kami akan membantu Anda melacaknya.",
        "Jika pesanan Anda belum tiba, silakan hubungi layanan pelanggan kami di support@contohlayanan.com dan kami akan membantu Anda melacak pesanan Anda.",
        "Jika pesanan Anda belum tiba tepat waktu, silakan hubungi layanan pelanggan kami di support@contohlayanan.com dan kami akan membantu Anda.",
        "Jika pesanan Anda terlambat, silakan hubungi kami di support@contohlayanan.com dan kami akan membantu Anda melacak pesanan Anda."
      ]
    },
    {
      "tag": "status_pesanan",
      "patterns": [
        "Bagaimana cara memeriksa status pesanan saya?",
        "Di mana saya bisa melihat status pesanan saya?",
        "Bagaimana saya bisa mengetahui status pesanan saya?",
        "Apa status pesanan saya?"
      ],
      "responses": [
        "Untuk memeriksa status pesanan Anda, masukkan nomor pesanan Anda di halaman pelacakan pesanan di situs web kami, atau beri tahu saya nomor pesanan Anda, dan saya akan memberikan informasi terkini.",
        "Anda dapat memeriksa status pesanan Anda dengan memasukkan nomor pesanan Anda di halaman pelacakan pesanan di situs web kami, atau Anda dapat memberi tahu saya nomor pesanan Anda dan saya akan membantu Anda.",
        "Anda dapat melihat status pesanan Anda dengan memasukkan nomor pesanan Anda di halaman pelacakan pesanan di situs web kami, atau Anda dapat memberi tahu saya nomor pesanan Anda dan saya akan membantu Anda.",
        "Untuk mengetahui status pesanan Anda, masukkan nomor pesanan Anda di halaman pelacakan pesanan di situs web kami, atau beri tahu saya nomor pesanan Anda dan saya akan memberikan informasi terkini."
      ]
    },
    {
      "tag": "biaya_pengiriman",
      "patterns": [
        "Apakah ada biaya tambahan untuk pengiriman?",
        "Berapa biaya pengiriman untuk produk ini?",
        "Apakah saya harus membayar biaya pengiriman?",
        "Apakah ada biaya pengiriman untuk produk ini?"
      ],
      "responses": [
        "Biaya pengiriman tergantung pada lokasi pengiriman dan metode yang dipilih. Detail biaya pengiriman akan ditampilkan saat proses checkout.",
        "Biaya pengiriman dapat bervariasi tergantung pada lokasi pengiriman dan metode pengiriman yang Anda pilih. Anda akan melihat biaya pengiriman saat checkout.",
        "Kami mengenakan biaya pengiriman yang bervariasi tergantung pada lokasi dan metode pengiriman. Biaya pengiriman akan ditampilkan saat Anda melakukan checkout.",
        "Ya, kami mengenakan biaya pengiriman yang akan ditampilkan saat Anda melakukan checkout. Biaya ini dapat bervariasi tergantung pada lokasi pengiriman dan metode yang Anda pilih."
      ]
    },
    {
      "tag": "ganti_alamat",
      "patterns": [
        "Bagaimana cara mengganti alamat pengiriman setelah pesanan dikonfirmasi?",
        "Bisakah saya mengubah alamat pengiriman setelah pesanan dikonfirmasi?",
        "Apa yang harus saya lakukan jika saya ingin mengubah alamat pengiriman setelah pesanan dikonfirmasi?",
        "Bagaimana cara saya mengubah alamat pengiriman setelah pesanan saya dikonfirmasi?"
      ],
      "responses": [
        "Jika Anda perlu mengganti alamat pengiriman, segera hubungi layanan pelanggan kami di support@contohlayanan.com. Kami akan berusaha membantu Anda secepat mungkin.",
        "Jika Anda ingin mengubah alamat pengiriman, silakan hubungi layanan pelanggan kami di support@contohlayanan.com secepat mungkin dan kami akan melakukan yang terbaik untuk membantu Anda.",
        "Untuk mengubah alamat pengiriman, Anda perlu menghubungi layanan pelanggan kami di support@contohlayanan.com secepat mungkin setelah pesanan dikonfirmasi.",
        "Jika Anda perlu mengubah alamat pengiriman setelah pesanan dikonfirmasi, silakan hubungi layanan pelanggan kami di support@contohlayanan.com dan kami akan membantu Anda."
      ]
    },
    {
      "tag": "faktur",
      "patterns": [
        "Bagaimana cara mendapatkan faktur untuk pesanan saya?",
        "Di mana saya bisa mendapatkan faktur untuk pesanan saya?",
        "Apakah saya bisa mendapatkan faktur untuk pesanan saya?",
        "Bagaimana saya bisa mendapatkan faktur untuk pesanan saya?"
      ],
      "responses": [
        "Faktur akan dikirimkan ke alamat email yang Anda berikan saat proses pembayaran. Jika Anda memerlukan salinan tambahan, beri tahu saya nomor pesanan Anda, dan saya akan mengirimkannya",
        "Anda akan menerima faktur di alamat email yang Anda berikan saat checkout. Jika Anda memerlukan salinan tambahan, beri tahu saya nomor pesanan Anda dan saya akan mengirimkannya.",
        "Faktur untuk pesanan Anda akan dikirim ke alamat email yang Anda berikan saat pembayaran. Jika Anda memerlukan salinan tambahan, beri tahu saya nomor pesanan Anda dan saya akan mengirimkannya.",
        "Faktur untuk pesanan Anda akan dikirim ke alamat email Anda setelah pembayaran. Jika Anda memerlukan salinan tambahan, beri tahu saya nomor pesanan Anda dan saya akan mengirimkannya."
      ]
    },
    {
      "tag": "kwitansi",
      "patterns": [
        "Bagaimana cara mendapatkan kwitansi pembelian?",
        "Di mana saya bisa mendapatkan kwitansi pembelian?",
        "Apakah saya bisa mendapatkan kwitansi pembelian?",
        "Bagaimana saya bisa mendapatkan kwitansi pembelian?"
      ],
      "responses": [
        "Kwitansi pembelian akan dikirimkan bersamaan dengan konfirmasi pesanan ke alamat email yang Anda berikan selama proses pembayaran.",
        "Anda akan menerima kwitansi pembelian di alamat email yang Anda berikan saat checkout.",
        "Kwitansi untuk pembelian Anda akan dikirim ke alamat email yang Anda berikan saat pembayaran.",
        "Kwitansi pembelian Anda akan dikirim ke alamat email Anda setelah pembayaran."
      ]
    },
    {
      "tag": "order_confirmation",
      "patterns": [
        "Bagaimana cara konfirmasi pemesanan?",
        "Saya sudah memesan, bagaimana selanjutnya?",
        "Apa yang harus saya lakukan setelah memesan?"
      ],
      "responses": [
        "Setelah memesan, Anda akan menerima email konfirmasi pesanan.",
        "Konfirmasi pesanan akan dikirimkan melalui email yang Anda berikan saat pemesanan.",
        "Pastikan untuk memeriksa email Anda setelah memesan untuk langkah-langkah selanjutnya."
      ]
    },
    {
      "tag": "diskon_produk",
      "patterns": [
        "Apakah ada diskon khusus untuk produk tertentu saat ini?",
        "Apakah ada diskon untuk produk tertentu pada hari-hari tertentu?",
        "Bagaimana cara mendapatkan diskon untuk produk yang baru diluncurkan?",
        "Apakah diskon berlaku untuk semua produk atau ada pengecualian?",
        "Apakah diskon dapat ditumpuk atau digabung dengan promosi lainnya?",
        "Apakah ada diskon tambahan untuk pengguna aplikasi seluler?"
      ],
      "responses": [
        "Ya, saat ini beberapa produk memiliki diskon spesial. Cek halaman promosi di situs web kami untuk informasi lebih lanjut.",
        "Ya, kami seringkali menawarkan diskon khusus untuk produk tertentu pada hari-hari tertentu. Pantau situs web atau buletin kami untuk pembaruan terbaru.",
        "Diskon untuk produk baru sering diumumkan di halaman promosi atau melalui buletin kami. Pastikan untuk mengikuti pembaruan kami.",
        "Beberapa produk mungkin dikecualikan dari diskon tertentu. Informasi ini biasanya tersedia di halaman detail produk atau dalam syarat dan ketentuan promosi.",
        "Kebijakan diskon kami mungkin berbeda-beda tergantung pada promosi. Beberapa diskon mungkin dapat ditumpuk, sementara yang lain tidak. Silakan cek syarat dan ketentuan promosi untuk detailnya.",
        "Ya, kami seringkali menawarkan diskon khusus untuk pengguna aplikasi seluler kami. Pastikan untuk mengunduh aplikasi kami dan cek bagian 'Promosi' untuk detailnya."
      ]
    },
    {
      "tag": "kode_diskon",
      "patterns": [
        "Bagaimana cara mendapatkan kode diskon?",
        "Bagaimana cara menggunakan kode diskon saat proses pembayaran?",
        "Bagaimana cara mendapatkan notifikasi tentang diskon eksklusif?"
      ],
      "responses": [
        "Anda dapat mendapatkan kode diskon melalui buletin kami atau mengikuti kami di media sosial. Kode tersebut seringkali tersedia selama promosi khusus.",
        "Saat checkout, Anda akan melihat kolom untuk memasukkan kode diskon. Masukkan kode tersebut, dan diskon akan diterapkan pada total pembelian.",
        "Jika Anda berlangganan buletin kami atau mengikuti kami di media sosial, Anda akan mendapatkan notifikasi tentang diskon eksklusif dan penawaran khusus."
      ]
    },
    {
      "tag": "sale_besar",
      "patterns": [
        "Kapan akan ada sale besar-besaran atau hari spesial diskon?",
        "Kapan sale besar atau diskon spesial berikutnya?",
        "Kapan sale besar berikutnya?",
        "Kapan diskon spesial berikutnya?"
      ],
      "responses": [
        "Sale besar dan hari diskon spesial biasanya diumumkan di situs web kami dan media sosial. Pastikan untuk mengikuti kami untuk mendapatkan pembaruan terkini.",
        "Kami biasanya mengumumkan sale besar dan hari diskon spesial di situs web kami dan media sosial. Jangan lupa untuk mengikuti kami agar tidak ketinggalan info terbaru.",
        "Informasi tentang sale besar dan hari diskon spesial biasanya dapat ditemukan di situs web kami dan media sosial kami. Pastikan untuk mengikuti kami untuk mendapatkan info terbaru.",
        "Untuk mengetahui kapan sale besar atau hari diskon spesial berikutnya, pastikan untuk mengikuti kami di situs web dan media sosial kami."
      ]
    },
    {
      "tag": "diskon_pelanggan_setia",
      "patterns": [
        "Apakah ada potongan harga untuk pelanggan yang kembali?",
        "Apakah ada program loyalitas yang menawarkan diskon tambahan?",
        "Apakah ada program referensi teman yang memberikan diskon?",
        "Bagaimana cara mendapatkan diskon ulang tahun?"
      ],
      "responses": [
        "Ya, kami menyediakan diskon khusus untuk pelanggan setia. Anda dapat memeriksa halaman akun atau buletin kami untuk penawaran tersebut.",
        "Ya, program loyalitas kami memberikan poin reward yang dapat ditukarkan dengan diskon tambahan. Kunjungi halaman program loyalitas di situs web kami untuk informasi lebih lanjut.",
        "Ya, kami memiliki program referensi teman yang memberikan diskon kepada Anda dan teman yang Anda referensikan. Lihat halaman referensi teman di situs web kami untuk informasi lebih lanjut.",
        "Kami memberikan diskon ulang tahun kepada pelanggan yang mendaftarkan tanggal ulang tahun mereka di akun. Pastikan informasi ulang tahun Anda sudah terdaftar."
      ]
    },
    {
      "tag": "diskon_khusus",
      "patterns": [
        "Apakah diskon pelajar atau diskon khusus lainnya tersedia?",
        "Apakah Anda menawarkan diskon pelajar atau diskon khusus lainnya?",
        "Apakah ada diskon khusus untuk pelajar?",
        "Apakah Anda memiliki diskon khusus untuk pelajar atau grup tertentu?"
      ],
      "responses": [
        "Ya, kami menyediakan diskon pelajar dan diskon khusus untuk kelompok tertentu. Hubungi kami untuk informasi lebih lanjut atau cek halaman promosi.",
        "Kami menawarkan diskon pelajar dan diskon khusus untuk beberapa kelompok. Untuk informasi lebih lanjut, silakan hubungi kami atau cek halaman promosi kami.",
        "Ya, kami memiliki diskon pelajar dan diskon khusus untuk kelompok tertentu. Silakan hubungi kami untuk detail lebih lanjut atau kunjungi halaman promosi kami.",
        "Kami menawarkan diskon pelajar dan diskon khusus untuk beberapa kelompok. Silakan hubungi kami untuk informasi lebih lanjut atau lihat halaman promosi kami."
      ]
    },
    {
      "tag": "pengguna_baru",
      "patterns": [
        "Bagaimana cara membuat akun baru di situs web Anda?",
        "Apa keuntungan menjadi pengguna terdaftar?",
        "Apakah saya perlu membuat akun untuk melakukan pembelian?",
        "Bagaimana cara mengubah informasi akun saya?",
        "Apa yang harus saya lakukan jika saya lupa kata sandi?",
        "Bagaimana cara berlangganan buletin atau pembaruan produk?",
        "Apakah akun saya akan tetap aktif jika saya tidak login untuk jangka waktu tertentu?",
        "Bagaimana cara mengaktifkan notifikasi email?",
        "Apakah ada program loyalitas untuk pelanggan setia?",
        "Apa yang harus saya lakukan jika saya tidak menerima email konfirmasi setelah mendaftar?",
        "Apakah saya dapat menggunakan akun media sosial saya untuk login?",
        "Apa yang perlu saya lakukan jika saya ingin mengubah alamat email yang terdaftar?",
        "Apakah ada panduan untuk memulai bagi pengguna baru?",
        "Apa yang harus saya lakukan jika saya mengalami kesulitan saat membuat akun?",
        "Bagaimana cara mendapatkan diskon selamat datang untuk pengguna baru?",
        "Apakah saya bisa menyimpan beberapa alamat pengiriman di akun saya?",
        "Bagaimana cara menghubungkan akun saya dengan program loyalitas?",
        "Apakah ada batasan usia untuk mendaftar akun?",
        "Apakah saya dapat mengganti nama pengguna saya?",
        "Bagaimana cara mendapatkan informasi tentang penawaran eksklusif untuk pengguna baru?"
      ],
      "responses": [
        "Selamat datang! Untuk membuat akun baru, kunjungi halaman pendaftaran di situs web kami dan ikuti langkah-langkah yang ditampilkan.",
        "Pengguna terdaftar dapat menikmati berbagai keuntungan, termasuk akses ke promo eksklusif, pembaruan produk, dan kemudahan dalam melacak pesanan.",
        "Tidak wajib, tetapi membuat akun memudahkan Anda untuk melacak pesanan, mengelola informasi pembayaran, dan mendapatkan penawaran eksklusif.",
        "Setelah login, Anda dapat mengakses halaman pengaturan akun untuk mengubah informasi pribadi, alamat, atau kata sandi.",
        "Di halaman login, klik opsi 'Lupa Kata Sandi' dan ikuti petunjuk untuk mereset kata sandi Anda.",
        "Anda dapat berlangganan buletin kami di situs web kami, biasanya dengan memasukkan alamat email Anda di bagian yang sesuai.",
        "Ya, akun Anda akan tetap aktif. Namun, pastikan untuk login secara berkala untuk menjaga keamanan akun Anda.",
        "Anda dapat mengaktifkan notifikasi email di halaman pengaturan akun. Ini memungkinkan Anda menerima pembaruan terkait pesanan dan penawaran khusus.",
        "Ya, kami memiliki program loyalitas yang memberikan poin reward, diskon eksklusif, dan keuntungan lainnya untuk pelanggan setia.",
        "Periksa folder spam atau sampah Anda. Jika email konfirmasi tidak ditemukan, hubungi kami melalui formulir kontak atau email di support@contohlayanan.com.",
        "Saat ini, kami belum menyediakan opsi login melalui media sosial. Anda dapat membuat akun baru atau melanjutkan sebagai tamu.",
        "Pada halaman pengaturan akun, Anda dapat mengganti alamat email Anda. Pastikan untuk memverifikasi email baru Anda.",
        "Ya, kami menyediakan panduan pengguna untuk membantu Anda memahami cara berbelanja, melacak pesanan, dan menggunakan fitur situs web kami. Cek di halaman bantuan atau hubungi kami jika Anda memerlukan bantuan tambahan.",
        "Jika Anda mengalami kesulitan, hubungi tim dukungan kami di support@contohlayanan.com atau gunakan opsi obrolan langsung di situs web.",
        "Diskon selamat datang biasanya ditawarkan saat pendaftaran. Anda juga dapat memeriksa halaman promosi di situs web kami.",
        "Ya, di halaman pengaturan akun Anda dapat menyimpan beberapa alamat pengiriman untuk memudahkan proses checkout.",
        "Saat membuat akun, Anda dapat memilih untuk bergabung dengan program loyalitas kami. Jika belum, kunjungi halaman pengaturan akun untuk mendaftar.",
        "Ya, untuk mendaftar akun, Anda harus berusia minimal 18 tahun. Ini untuk mematuhi kebijakan privasi dan persyaratan hukum.",
        "Ya, Anda dapat mengganti nama pengguna di halaman pengaturan akun. Pastikan untuk menyimpan perubahan tersebut."
      ]
    },
    {
      "tag": "keamanan_akun",
      "patterns": [
        "Bagaimana cara menjaga keamanan akun saya?",
        "Apa langkah-langkah keamanan yang disarankan untuk akun saya?",
        "Bagaimana saya bisa melindungi kata sandi saya?",
        "Apakah ada tips keamanan untuk pengguna baru?",
        "Apa yang harus saya lakukan jika saya menduga akun saya diretas?",
        "Bagaimana cara mengaktifkan otentikasi dua faktor?",
        "Apakah ada fitur keamanan tambahan yang dapat saya aktifkan?"
      ],
       "responses": [
        "Untuk menjaga keamanan akun Anda, pastikan untuk menggunakan kata sandi yang kuat dan tidak pernah memberikannya kepada orang lain.",
        "Langkah-langkah keamanan yang disarankan termasuk memperbarui kata sandi secara berkala dan tidak menggunakan kata sandi yang sama untuk beberapa layanan.",
        "Anda bisa melindungi kata sandi Anda dengan tidak membagikannya dengan orang lain, menggunakan kombinasi huruf, angka, dan simbol, serta menghindari kata sandi yang mudah ditebak.",
        "Tips keamanan untuk pengguna baru meliputi membuat kata sandi yang kompleks, mengaktifkan notifikasi keamanan, dan selalu logout setelah selesai menggunakan akun.",
        "Jika Anda menduga akun Anda diretas, segera ubah kata sandi Anda dan hubungi dukungan kami untuk bantuan lebih lanjut.",
        "Anda dapat mengaktifkan otentikasi dua faktor untuk lapisan keamanan ekstra. Ini melibatkan penggunaan kode yang dikirimkan ke perangkat seluler Anda sebagai bentuk verifikasi tambahan.",
        "Ya, kami memiliki fitur keamanan tambahan seperti pemantauan aktivitas login dan notifikasi keamanan. Anda dapat mengaktifkannya di halaman pengaturan akun Anda."
      ]
    },
    {
      "tag": "keamanan_pembayaran",
      "patterns": [
        "Bagaimana keamanan pembayaran dijamin?",
        "Apakah transaksi pembayaran saya aman?",
        "Apa yang harus saya perhatikan saat melakukan pembayaran online?",
        "Apakah informasi kartu kredit saya aman di situs ini?"
      ],
      "responses": [
        "Keamanan pembayaran dijamin melalui enkripsi data. Pastikan untuk hanya menggunakan metode pembayaran yang aman dan terpercaya.",
        "Transaksi pembayaran Anda aman dengan penggunaan protokol keamanan yang terenkripsi. Kami tidak menyimpan informasi kartu kredit Anda setelah transaksi selesai.",
        "Saat melakukan pembayaran online, perhatikan URL yang dimulai dengan 'https', pastikan menggunakan sambungan yang aman, dan hindari mengakses situs dari tautan yang mencurigakan.",
        "Informasi kartu kredit Anda dijamin aman di situs kami. Kami menggunakan metode keamanan terkini untuk melindungi data pembayaran pelanggan."
      ]
    },
    {
      "tag": "lapor_keamanan",
      "patterns": [
        "Bagaimana cara melaporkan masalah keamanan?",
        "Apa yang harus saya lakukan jika menemukan celah keamanan?",
        "Apakah ada program penghargaan untuk laporan keamanan?",
        "Siapa yang harus dihubungi jika saya khawatir tentang keamanan akun saya?"
      ],
      "responses": [
        "Jika Anda menemui masalah keamanan, harap laporkan segera kepada tim dukungan kami melalui email di security@contohlayanan.com.",
        "Jika Anda menemukan celah keamanan, laporkan detailnya kepada tim kami. Kami menghargai kontribusi Anda dalam meningkatkan keamanan platform kami.",
        "Kami memiliki program penghargaan keamanan untuk mereka yang melaporkan celah keamanan yang signifikan. Hubungi kami untuk informasi lebih lanjut.",
        "Jika Anda khawatir tentang keamanan akun Anda, segera hubungi tim dukungan kami di support@contohlayanan.com untuk bantuan lebih lanjut."
      ]
    },
    {
      "tag": "kebijakan_privasi",
      "patterns": [
        "Bagaimana kebijakan privasi Anda?",
        "Apa yang termasuk dalam kebijakan privasi situs ini?",
        "Bagaimana data pelanggan dijaga privasinya?",
        "Apakah informasi pribadi saya aman di sini?"
      ],
      "responses": [
        "Kami memiliki kebijakan privasi yang ketat untuk melindungi data pelanggan. Anda dapat menemukan detailnya di halaman kebijakan privasi kami.",
        "Kebijakan privasi kami mencakup pengumpulan, penggunaan, dan perlindungan informasi pribadi pelanggan. Pastikan untuk membacanya secara cermat di halaman kebijakan privasi.",
        "Data pelanggan sangat dijaga privasinya. Kami hanya menggunakan informasi yang diperlukan untuk transaksi dan tidak membagikannya dengan pihak ketiga tanpa izin Anda.",
        "Informasi pribadi Anda aman di sini. Kami mengimplementasikan langkah-langkah keamanan untuk melindungi data pelanggan dari akses yang tidak sah."
      ]
    },
    {
      "tag": "data_pribadi",
      "patterns": [
        "Apa jenis data pribadi yang Anda kumpulkan?",
        "Bagaimana cara Anda menggunakan informasi pribadi saya?",
        "Apakah data pribadi saya dijual kepada pihak ketiga?",
        "Bagaimana saya bisa mengakses atau menghapus data pribadi saya?"
      ],
      "responses": [
        "Kami hanya mengumpulkan informasi pribadi yang diperlukan untuk transaksi dan pengiriman. Detailnya dapat ditemukan di kebijakan privasi kami.",
        "Informasi pribadi Anda digunakan untuk pemrosesan pesanan dan komunikasi terkait. Kami tidak menggunakan informasi tersebut untuk tujuan lain tanpa izin Anda.",
        "Kami tidak menjual data pribadi pelanggan kepada pihak ketiga. Privasi Anda adalah prioritas bagi kami.",
        "Anda dapat mengakses atau menghapus data pribadi Anda melalui akun Anda di situs kami. Jika perlu bantuan, hubungi tim dukungan kami."
      ]
    },
    {
      "tag": "keamanan_data",
      "patterns": [
        "Bagaimana keamanan data pelanggan dijaga?",
        "Apakah informasi kartu kredit saya aman di sini?",
        "Apakah ada enkripsi yang digunakan untuk melindungi data?",
        "Apa yang harus saya lakukan jika saya khawatir tentang keamanan data saya?"
      ],
      "responses": [
        "Kami menjaga keamanan data pelanggan dengan mengimplementasikan langkah-langkah keamanan seperti enkripsi dan kontrol akses yang ketat.",
        "Informasi kartu kredit Anda aman di sini. Kami tidak menyimpan informasi kartu kredit setelah transaksi selesai.",
        "Ya, kami menggunakan enkripsi untuk melindungi data pelanggan selama proses transaksi dan penyimpanan.",
        "Jika Anda khawatir tentang keamanan data Anda, segera hubungi tim dukungan kami. Kami siap membantu dan menjawab pertanyaan Anda."
      ]
    },
    {
      "tag": "cookie_privasi",
      "patterns": [
        "Bagaimana situs ini menggunakan cookies?",
        "Apakah saya bisa menonaktifkan cookies?",
        "Apakah cookies membahayakan privasi saya?",
        "Apa yang harus saya lakukan jika saya tidak ingin menerima cookies?"
      ],
      "responses": [
        "Kami menggunakan cookies untuk meningkatkan pengalaman pengguna. Detailnya dapat ditemukan di kebijakan privasi kami.",
        "Anda dapat menonaktifkan cookies melalui pengaturan browser Anda. Namun, perlu diingat bahwa ini dapat mempengaruhi fungsi situs.",
        "Cookies yang kami gunakan tidak membahayakan privasi Anda"
      ]
    },
   {
      "tag": "proses_pembelian",
      "patterns": [
        "Bagaimana proses pembelian di situs ini?",
        "Apa langkah-langkah untuk melakukan pembelian?",
        "Cara memesan produk di sini?",
        "Saya ingin membeli, bagaimana caranya?"
      ],
       "responses": [
        "Proses pembelian di situs kami sangat mudah. Pilih produk yang Anda inginkan, tambahkan ke keranjang, dan ikuti langkah-langkah checkout.",
        "Langkah pertama adalah memilih produk yang Anda inginkan. Setelah itu, klik 'Tambah ke Keranjang' dan ikuti langkah-langkah checkout untuk menyelesaikan pembelian Anda.",
        "Untuk memesan produk, Anda perlu memilih item yang diinginkan, tambahkan ke keranjang belanja, dan lakukan proses pembayaran saat checkout.",
        "Anda dapat membeli produk dengan memilih item, menambahkannya ke keranjang belanja, dan mengikuti langkah-langkah pembayaran di halaman checkout."
      ]
   },
   {
      "tag": "metode_pembayaran",
      "patterns": [
        "Apa metode pembayaran yang diterima?",
        "Cara membayar pesanan?",
        "Metode pembayaran apa yang tersedia?",
        "Bagaimana saya bisa melakukan pembayaran?"
      ],
      "responses": [
        "Kami menerima berbagai metode pembayaran, termasuk kartu kredit, transfer bank, dan pembayaran melalui aplikasi pembayaran online.",
        "Anda dapat membayar pesanan Anda melalui kartu kredit, transfer bank, atau menggunakan aplikasi pembayaran online yang tersedia.",
        "Metode pembayaran yang tersedia meliputi kartu kredit, transfer bank, dan beberapa opsi pembayaran digital. Pilih metode yang paling nyaman untuk Anda.",
        "Pembayaran dapat dilakukan dengan kartu kredit, transfer bank, atau melalui aplikasi pembayaran yang kami dukung. Pilih opsi yang sesuai saat melakukan checkout."
      ]
    
    },
    {
      "tag": "status_pesanan",
      "patterns": [
         "Bagaimana cara melacak status pesanan saya?",
         "Cara cek status pesanan",
         "Saya ingin tahu di mana pesanan saya sekarang",
         "Apakah ada cara untuk mengetahui pesanan sedang diproses?"
      ],
       "responses": [
        "Anda dapat melacak status pesanan Anda dengan masuk ke akun Anda dan menavigasi ke halaman status pesanan. Kami juga akan mengirimkan pembaruan melalui email.",
        "Cara termudah untuk melacak status pesanan adalah dengan masuk ke akun Anda dan periksa halaman status pesanan. Kami juga akan memberi tahu Anda melalui email setiap kali ada pembaruan.",
        "Untuk mengecek status pesanan, login ke akun Anda dan kunjungi halaman status pesanan. Kami juga akan memberikan pembaruan melalui email.",
        "Anda bisa mengetahui status pesanan Anda dengan masuk ke akun Anda dan melihat halaman status pesanan. Kami juga akan memberi tahu Anda secara berkala melalui email."
      ]
    },
    {
       "tag": "pembatalan_pesanan",
       "patterns": [
        "Bagaimana cara membatalkan pesanan?",
        "Saya ingin membatalkan pesanan",
        "Bisakah saya membatalkan pembelian?",
        "Prosedur pembatalan pesanan"
      ],
       "responses": [
         "Jika Anda ingin membatalkan pesanan, segera hubungi tim dukungan kami melalui email atau obrolan langsung untuk bantuan lebih lanjut.",
         "Anda bisa membatalkan pesanan dengan menghubungi tim dukungan kami secepatnya. Pastikan untuk memberikan detail pesanan Anda agar proses pembatalan dapat segera dilakukan.",
         "Jika Anda ingin membatalkan pembelian, hubungi tim dukungan kami sesegera mungkin. Proses pembatalan akan bergantung pada status pesanan Anda.",
         "Prosedur pembatalan pesanan dapat dilakukan dengan menghubungi tim dukungan kami melalui email atau obrolan langsung. Pastikan untuk memberikan informasi pesanan dengan jelas."
      ] 
    },
    {
       "tag": "pengembalian_produk",
       "patterns": [
         "Bagaimana cara mengembalikan produk?",
         "Prosedur pengembalian barang",
         "Saya ingin mengembalikan produk",
         "Apa langkah-langkah untuk pengembalian produk?"
      ],
       "responses": [
         "Untuk mengembalikan produk, hubungi tim dukungan kami dan berikan detail pesanan. Kami akan memberi petunjuk lebih lanjut mengenai prosedur pengembalian.",
         "Langkah pertama untuk pengembalian produk adalah menghubungi tim dukungan kami. Berikan informasi pesanan, dan kami akan membimbing Anda melalui proses pengembalian.",
         "Jika Anda ingin mengembalikan produk, segera hubungi tim dukungan kami dan berikan informasi lengkap mengenai pesanan Anda. Kami akan membantu Anda dengan prosedur pengembalian.",
         "Prosedur pengembalian barang dapat dimulai dengan menghubungi tim dukungan kami. Jangan ragu memberikan rincian pesanan untuk proses yang lebih cepat."
      ]
    }
 ]
}






    




     




